Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:expr:`lv_obj_free_id(widget)` will be called at the end of the sequence when each Widget is deleted.
it_it: :cpp:expr:`lv_obj_free_id(widget)` verrà chiamato al termine della sequenza quando ogni Widget viene eliminato.

source: :cpp:expr:`lv_obj_get_child(parent, idx)`: Return a specific child of a parent.
it_it: :cpp:expr:`lv_obj_get_child(parent, idx)`: Restituisce un figlio specifico di un genitore.

source: :cpp:expr:`lv_obj_get_child_by_name(parent, "container/button/text")`: Get a Widget by navigating a path using parent names (separated by ``/``).
it_it: :cpp:expr:`lv_obj_get_child_by_name(parent, "container/button/text")`: Ottiene un Widget navigando in un percorso utilizzando i nomi degli elementi padre (separati da ``/``).

source: :cpp:expr:`lv_obj_get_child_by_type(parent, idx, &lv_slider_class)`: Similar to :cpp:expr:`lv_obj_get_child` but filters to children with a given type.
it_it: :cpp:expr:`lv_obj_get_child_by_type(parent, idx, &lv_slider_class)`: Simile a :cpp:expr:`lv_obj_get_child`, ma filtra gli elementi figlio con un tipo specificato.

source: :cpp:expr:`lv_obj_get_index(widget)`: Return the index of the Widget in its parent.
it_it: :cpp:expr:`lv_obj_get_index(widget)`: Restituisce l'indice del Widget nel suo elemento padre.

source: :cpp:expr:`lv_obj_get_parent(widget)`: Get the Widget's current parent.
it_it: :cpp:expr:`lv_obj_get_parent(widget)`: Ottiene l'elemento padre corrente del Widget.

source: :cpp:expr:`lv_obj_get_screen(widget)`: Get a Widget's screen ("root" parent).
it_it: :cpp:expr:`lv_obj_get_screen(widget)`: Ottiene lo "Screen" [schermata] di un Widget (elemento padre "root").

source: :cpp:expr:`lv_obj_get_scroll_bottom(widget)` Pixels scrolled past bottom of Widget's view window.
it_it: :cpp:expr:`lv_obj_get_scroll_bottom(widget)` Pixel che hanno superato la parte inferiore della finestra di visualizzazione del Widget.

source: :cpp:expr:`lv_obj_get_scroll_left(widget)` Identical to :cpp:expr:`lv_obj_get_scroll_x(widget)`.
it_it: :cpp:expr:`lv_obj_get_scroll_left(widget)` Identico a :cpp:expr:`lv_obj_get_scroll_x(widget)`.

source: :cpp:expr:`lv_obj_get_scroll_right(widget)` Pixels scrolled past right edge of Widget's view window.
it_it: :cpp:expr:`lv_obj_get_scroll_right(widget)` Pixel scorsi oltre il bordo destro della finestra di visualizzazione del Widget.

source: :cpp:expr:`lv_obj_get_scroll_top(widget)` Identical to :cpp:expr:`lv_obj_get_scroll_y(widget)`
it_it: :cpp:expr:`lv_obj_get_scroll_top(widget)` Identico a :cpp:expr:`lv_obj_get_scroll_y(widget)`

source: :cpp:expr:`lv_obj_get_scroll_x(widget)` Pixels scrolled past left edge of Widget's view window.
it_it: :cpp:expr:`lv_obj_get_scroll_x(widget)` Pixel che hanno superato il bordo sinistro della finestra di visualizzazione del Widget.

source: :cpp:expr:`lv_obj_get_scroll_y(widget)` Pixels scrolled past top of Widget's view window.
it_it: :cpp:expr:`lv_obj_get_scroll_y(widget)` Pixel che hanno superato la parte superiore della finestra di visualizzazione del Widget.

source: :cpp:expr:`lv_obj_move_to_index(widget, idx)`: Move the Widget to a specified index.
it_it: :cpp:expr:`lv_obj_move_to_index(widget, idx)`: Sposta il Widget a un indice specificato.

source: :cpp:expr:`lv_obj_remove_from_subject(widget, subject)` deletes all Observers associated with ``widget``.
it_it: :cpp:expr:`lv_obj_remove_from_subject(widget, subject)` elimina tutti gli Observer associati a ``widget``.

source: :cpp:expr:`lv_obj_scroll_by(widget, dx, dy, anim_enable)` Scroll by given amount of pixels.
it_it: :cpp:expr:`lv_obj_scroll_by(widget, dx, dy, anim_enable)` Scorrimento di un numero specificato di pixel.

source: :cpp:expr:`lv_obj_scroll_by_bounded(widget, dx, dy, animation_enable)` Scroll by given amount of pixels.
it_it: :cpp:expr:`lv_obj_scroll_by_bounded(widget, dx, dy, animation_enable)` Scorre di un numero specificato di pixel.

source: :cpp:expr:`lv_obj_scroll_to(widget, x, y, animation_enable)` Scroll to given coordinate on Widget.
it_it: :cpp:expr:`lv_obj_scroll_to(widget, x, y, animation_enable)` Scorre fino alla coordinata specificata sul Widget.

source: :cpp:expr:`lv_obj_scroll_to_view(widget, animation_enable)` Scroll ``obj``'s parent Widget until ``obj`` becomes visible.
it_it: :cpp:expr:`lv_obj_scroll_to_view(widget, animation_enable)` Scorre il Widget padre di ``obj`` finché ``obj`` non diventa visibile.

source: :cpp:expr:`lv_obj_scroll_to_view_recursive(widget, animation_enable)` Scroll ``obj``'s parent Widgets recursively until ``obj`` becomes visible.
it_it: :cpp:expr:`lv_obj_scroll_to_view_recursive(widget, animation_enable)` Scorre ricorsivamente i widget padre di ``obj`` finché ``obj`` non diventa visibile.

source: :cpp:expr:`lv_obj_scroll_to_x(widget, x, animation_enable)` Scroll to X coordinate on Widget.
it_it: :cpp:expr:`lv_obj_scroll_to_x(widget, x, animation_enable)` Scorre fino alla coordinata X sul Widget.

source: :cpp:expr:`lv_obj_scroll_to_y(widget, y, animation_enable)` Scroll to Y coordinate on Widget.
it_it: :cpp:expr:`lv_obj_scroll_to_y(widget, y, animation_enable)` Scorre fino alla coordinata Y sul Widget.

source: :cpp:expr:`lv_obj_set_scrollbar_mode(widget, LV_SCROLLBAR_MODE_...)` sets the scrollbar mode on a Widget.
it_it: :cpp:expr:`lv_obj_set_scrollbar_mode(widget, LV_SCROLLBAR_MODE_...)` imposta la modalità della barra di scorrimento per un widget.

source: :cpp:expr:`lv_obj_set_subject_increment_event_max_value(obj, dsc, max_value)`: Set a maximum value for the event.
it_it: :cpp:expr:`lv_obj_set_subject_increment_event_max_value(obj, dsc, max_value)`: Imposta un valore massimo per l'evento.

source: :cpp:expr:`lv_obj_set_subject_increment_event_min_value(obj, dsc, min_value)`: Set a minimum value for the event.
it_it: :cpp:expr:`lv_obj_set_subject_increment_event_min_value(obj, dsc, min_value)`: Imposta un valore minimo per l'evento.

source: :cpp:expr:`lv_obj_set_subject_increment_event_rollover(obj, dsc, rollover)`: Set what to do when the min/max value is crossed.
it_it: :cpp:expr:`lv_obj_set_subject_increment_event_rollover(obj, dsc, rollover)`: Imposta cosa fare quando viene superato il valore min/max.

source: :cpp:expr:`lv_obj_swap(widget1, widget2)`: Swap the positions of two Widgets.
it_it: :cpp:expr:`lv_obj_swap(widget1, widget2)`: Scambia le posizioni di due Widget.

source: :cpp:expr:`lv_observer_remove(observer)` deletes that specific Observer and gracefully disconnects it from its ``subject`` and any associated Widgets, where ``observer`` is the return value any of the above ``lv_subject_add_observer_...()`` functions.
it_it: :cpp:expr:`lv_observer_remove(observer)` elimina quello specifico Observer e lo disconnette automaticamente dal suo ``subject`` e da tutti i Widget associati, dove ``observer`` è il valore restituito da una qualsiasi delle funzioni ``lv_subject_add_observer_...()`` sopra.

source: :cpp:expr:`lv_refr_now(NULL)` can also be called manually to force LVGL to refresh the emulated display.
it_it: :cpp:expr:`lv_refr_now(NULL)` può anche essere chiamato manualmente per forzare LVGL ad aggiornare il display emulato.

source: :cpp:expr:`lv_refr_now(NULL)` is called at the end of both functions to ensure that animations and widget coordinates are recalculated.
it_it: :cpp:expr:`lv_refr_now(NULL)` viene chiamato alla fine di entrambe le funzioni per garantire che le animazioni e le coordinate dei widget vengano ricalcolate.

source: :cpp:expr:`lv_roller_get_selected_str(roller, buf, buf_size)` will copy the name of the selected item to ``buf``.
it_it: :cpp:expr:`lv_roller_get_selected_str(roller, buf, buf_size)` copierà il nome dell'elemento selezionato in ``buf``.

source: :cpp:expr:`lv_scale_set_range(scale, min, max)`, and
it_it: :cpp:expr:`lv_scale_set_range(scale, min, max)`, e

source: :cpp:expr:`lv_scale_set_total_tick_count(scale, total_tick_count)`, and
it_it: :cpp:expr:`lv_scale_set_total_tick_count(scale, total_tick_count)` e

source: :cpp:expr:`lv_slider_set_orientation(slider, orientation)` to override orientation caused by ``width`` and ``height``.
it_it: :cpp:expr:`lv_slider_set_orientation(slider, orientation)` per sovrascrivere l'orientamento determinato da ``width`` e ``height``.

source: :cpp:expr:`lv_slider_set_range(slider, min , max)`; and
it_it: :cpp:expr:`lv_slider_set_range(slider, min, max)`; e

source: :cpp:expr:`lv_slider_set_value(slider, new_value, LV_ANIM_ON/OFF)` (animation time is set by the styles' ``anim_time`` property);
it_it: :cpp:expr:`lv_slider_set_value(slider, new_value, LV_ANIM_ON/OFF)` (il tempo di animazione è impostato dalla proprietà ``anim_time`` degli stili);

source: :cpp:expr:`lv_spangroup_get_child(spangroup, id)` will return a pointer to the child Span at index ``id``.
it_it: :cpp:expr:`lv_spangroup_get_child(spangroup, id)` restituirà un puntatore all'elemento figlio Span all'indice ``id``.

source: :cpp:expr:`lv_spinbox_increment(spinbox)` and :cpp:expr:`lv_spinbox_decrement(spinbox)` increments/decrements the value of the Spinbox according to the currently-selected digit.
it_it: :cpp:expr:`lv_spinbox_increment(spinbox)` e :cpp:expr:`lv_spinbox_decrement(spinbox)` incrementano/decrementano il valore dello Spinbox in base alla cifra attualmente selezionata.

source: :cpp:expr:`lv_spinbox_set_cursor_pos(spinbox, 1)` sets the cursor to a specific digit to change on increment/decrement.
it_it: :cpp:expr:`lv_spinbox_set_cursor_pos(spinbox, 1)` imposta il cursore su una cifra specifica da modificare in caso di incremento/decremento.

source: :cpp:expr:`lv_spinbox_set_digit_format(spinbox, digit_count, separator_position)` sets the number format.
it_it: :cpp:expr:`lv_spinbox_set_digit_format(spinbox, digit_count, separator_position)` imposta il formato del numero.

source: :cpp:expr:`lv_spinbox_set_range(spinbox, -1000, 2500)` sets its range.
it_it: :cpp:expr:`lv_spinbox_set_range(spinbox, -1000, 2500)` ne imposta l'intervallo.

source: :cpp:expr:`lv_spinbox_set_rollover(spinbox, true/false)` enables/disables rollover mode.
it_it: :cpp:expr:`lv_spinbox_set_rollover(spinbox, true/false)` abilita/disabilita la modalità rollover.

source: :cpp:expr:`lv_spinbox_set_step(spinbox, 100)` sets which digit to change on increment/decrement.
it_it: :cpp:expr:`lv_spinbox_set_step(spinbox, 100)` imposta quale cifra modificare durante l'incremento/decremento.

source: :cpp:expr:`lv_spinbox_set_value(spinbox, 1234)` sets a new value for the Spinbox.
it_it: :cpp:expr:`lv_spinbox_set_value(spinbox, 1234)` imposta un nuovo valore per lo Spinbox.

source: :cpp:expr:`lv_subject_deinit(subject)` gracefully disconnects ``subject`` from all associated Observers and Widget events.
it_it: :cpp:expr:`lv_subject_deinit(subject)` disconnette automaticamente ``subject`` da tutti gli Observer e gli eventi Widget associati.

source: :cpp:expr:`lv_sysmon_performance_pause(disp)` pauses the perf monitor.
it_it: :cpp:expr:`lv_sysmon_performance_pause(disp)` mette in pausa il perf monitor.

source: :cpp:expr:`lv_sysmon_performance_resume(disp)` resumes the perf monitor.
it_it: :cpp:expr:`lv_sysmon_performance_resume(disp)` riprende il perf monitor.

source: :cpp:expr:`lv_table_get_selected_cell(table, &row, &col)` can be used to get the currently selected cell.
it_it: :cpp:expr:`lv_table_get_selected_cell(table, &row, &col)` può essere utilizzato per ottenere la cella attualmente selezionata.

source: :cpp:expr:`lv_tabview_create(parent)` creates a new empty Tab View.
it_it: :cpp:expr:`lv_tabview_create(parent)` crea una nuova Tab View vuota.

source: :cpp:expr:`lv_tabview_get_content(tabview)` returns a pointer to the container for tabs content (a :ref:`base_widget`)
it_it: :cpp:expr:`lv_tabview_get_content(tabview)` restituisce un puntatore al contenitore per il contenuto delle schede (un :ref:`base_widget`)

source: :cpp:expr:`lv_tabview_get_tab_active(tabview)` returns the zero based index of the current tab.
it_it: :cpp:expr:`lv_tabview_get_tab_active(tabview)` restituisce l'indice a base zero della scheda corrente.

source: :cpp:expr:`lv_tabview_get_tab_bar(tabview)` returns a pointer to the container for tab buttons (a :ref:`base_widget`)
it_it: :cpp:expr:`lv_tabview_get_tab_bar(tabview)` restituisce un puntatore al contenitore per i pulsanti delle schede (un :ref:`base_widget`)

source: :cpp:expr:`lv_test_fast_forward(ms)`: Jumps ``ms`` milliseconds ahead and calls ``lv_timer_handler`` only once at the end.
it_it: :cpp:expr:`lv_test_fast_forward(ms)`: Salta in avanti di ``ms`` millisecondi e chiama ``lv_timer_handler`` solo una volta alla fine.

source: :cpp:expr:`lv_test_wait(ms)`: Emulates that ``ms`` milliseconds have elapsed, but it also calls ``lv_timer_handler`` after each millisecond.
it_it: :cpp:expr:`lv_test_wait(ms)`: Emula che siano trascorsi ``ms`` millisecondi, ma chiama anche ``lv_timer_handler`` dopo ogni millisecondo.

source: :cpp:expr:`lv_textarea_clear_selection(textarea)` clears current text selection.
it_it: :cpp:expr:`lv_textarea_clear_selection(textarea)` cancella la selezione del testo corrente.

source: :cpp:expr:`lv_textarea_get_text_selection(textarea)` tells whether text selection is enabled.
it_it: :cpp:expr:`lv_textarea_get_text_selection(textarea)` indica se la selezione del testo è abilitata.

source: :cpp:expr:`lv_textarea_set_insert_replace(textarea, "New text")` can be called from within that event to replace the text to be inserted.
it_it: :cpp:expr:`lv_textarea_set_insert_replace(textarea, "New text")` può essere chiamato dall'interno di quell'evento per sostituire il testo da inserire.

source: :cpp:expr:`lv_textarea_set_text(textarea, "New text")` replaces all existing text with "New text".
it_it: :cpp:expr:`lv_textarea_set_text(textarea, "New text")` sostituisce tutto il testo esistente con "New text".

source: :cpp:expr:`lv_textarea_text_is_selected(textarea)` tells whether any text is currently selected.
it_it: :cpp:expr:`lv_textarea_text_is_selected(textarea)` indica se è attualmente selezionato del testo.

source: :cpp:expr:`lv_theme_set_parent(new_theme, base_theme)` extends the ``base_theme`` with the ``new_theme``.
it_it: :cpp:expr:`lv_theme_set_parent(new_theme, base_theme)` estende ``base_theme`` con ``new_theme``.

source: :cpp:expr:`lv_tileview_add_tile(tileview, col_id, row_id, dir)` creates a new tile on the ``col_id``\ -th column and ``row_id``\ -th row.
it_it: :cpp:expr:`lv_tileview_add_tile(tileview, col_id, row_id, dir)` crea un nuovo tile nella colonna ``col_id``\ -esima e nella riga ``row_id``\ -esima.

source: :cpp:expr:`lv_tileview_get_tile_active(tileview)` can be used within the event to get a pointer to the newly-displayed tile.
it_it: :cpp:expr:`lv_tileview_get_tile_active(tileview)` può essere utilizzato all'interno dell'evento per ottenere un puntatore al tile appena visualizzato.

source: :cpp:expr:`lv_timer_pause(timer)` pauses the specified Timer.
it_it: :cpp:expr:`lv_timer_pause(timer)` mette in pausa il Timer specificato.

source: :cpp:expr:`lv_timer_ready(timer)` makes a Timer run on the next call of :cpp:func:`lv_timer_handler`.
it_it: :cpp:expr:`lv_timer_ready(timer)` fa sì che un Timer venga eseguito alla successiva chiamata di :cpp:func:`lv_timer_handler`.

source: :cpp:expr:`lv_timer_reset(timer)` resets the period of a Timer.
it_it: :cpp:expr:`lv_timer_reset(timer)` azzera il periodo di un Timer.

source: :cpp:expr:`lv_timer_resume(timer)` resumes the specified Timer.
it_it: :cpp:expr:`lv_timer_resume(timer)` riprende il Timer specificato.

source: :cpp:expr:`lv_win_add_button(win, icon, button_width)` adds a Button with the specified width that occupies the full height of the Header (its parent).
it_it: :cpp:expr:`lv_win_add_button(win, icon, button_width)` aggiunge un Pulsante con la larghezza specificata che occupa l'intera altezza dell'Header (il suo elemento padre).

source: :cpp:expr:`lv_win_add_title(win, "The title")` adds a Label to the header, with long mode :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` so that if its text contents are wider than the area it has, the text will be truncated with an ellipsis ("...") placed at the end of the text.
it_it: :cpp:expr:`lv_win_add_title(win, "The title")` aggiunge una Label all'intestazione, con modalità estesa :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` in modo che se il contenuto del testo è più ampio dell'area a sua disposizione, il testo verrà troncato con un'ellissi ("...") posta alla fine del testo.

source: :cpp:expr:`lv_win_create(parent)` creates a Window that is initially composed of the following Widget structure:
it_it: :cpp:expr:`lv_win_create(parent)` crea una Window inizialmente composta dalla seguente struttura di Widget:

source: :cpp:expr:`lv_win_get_header(win)` returns a pointer to the header, :cpp:expr:`lv_win_get_content(win)` returns a pointer to the content container to which the content of the window can be added.
it_it: :cpp:expr:`lv_win_get_header(win)` restituisce un puntatore all'intestazione, :cpp:expr:`lv_win_get_content(win)` restituisce un puntatore al contenitore a cui è possibile aggiungere il contenuto della finestra.

source: :cpp:expr:`lv_xml_component_get_scope(component_name)` returns a pointer to a "scope descriptor" that can be used to register data available only for a given component.
it_it: :cpp:expr:`lv_xml_component_get_scope(component_name)` restituisce un puntatore a uno "scope descriptor" utilizzabile per registrare i dati disponibili solo per un determinato componente.

source: :cpp:expr:`lv_xml_load_all_from_path("A:path/to/dir")` will traverse a directory and register all XML Components, Screens, globals, and translations.
it_it: :cpp:expr:`lv_xml_load_all_from_path("A:path/to/dir")` attraverserà una directory e registrerà tutti i componenti XML, le schermate, le variabili globali e le traduzioni.

source: :cpp:expr:`lv_xml_test_run_next()` returns ``true`` if the given step passed, or ``false`` if it failed.
it_it: :cpp:expr:`lv_xml_test_run_next()` restituisce ``true`` se il passaggio specificato è stato superato, o ``false`` se non è stato superato.

source: :cpp:expr:`my_get_milliseconds()` needs to return the number of milliseconds elapsed since system start up.
it_it: :cpp:expr:`my_get_milliseconds()` deve restituire il numero di millisecondi trascorsi dall'avvio del sistema.

source: :cpp:func:`lv_anim_path_bounce`: bounce back a little from the end value (like hitting a wall)
it_it: :cpp:func:`lv_anim_path_bounce`: rimbalza leggermente dal valore finale (come se colpisse un muro)

source: :cpp:func:`lv_anim_path_ease_in_out`: slow at the beginning and end
it_it: :cpp:func:`lv_anim_path_ease_in_out`: lenta all'inizio e alla fine

source: :cpp:func:`lv_anim_path_ease_in`: slow at the beginning
it_it: :cpp:func:`lv_anim_path_ease_in`: lenta all'inizio

source: :cpp:func:`lv_anim_path_ease_out`: slow at the end
it_it: :cpp:func:`lv_anim_path_ease_out`: lenta alla fine

source: :cpp:func:`lv_anim_path_linear`: linear Animation (default)
it_it: :cpp:func:`lv_anim_path_linear`: Animazione lineare (predefinita)

source: :cpp:func:`lv_anim_path_overshoot`: overshoot the end value
it_it: :cpp:func:`lv_anim_path_overshoot`: supera il valore finale

source: :cpp:func:`lv_anim_path_step`: change in one step at the end
it_it: :cpp:func:`lv_anim_path_step`: modifica di un passo alla fine

source: :cpp:func:`lv_anim_set_path_cb` registers `path_cb` callback.
it_it: :cpp:func:`lv_anim_set_path_cb` registra la callback `path_cb`.

source: :cpp:func:`lv_binfont_create_from_buffer` can be used to load a font from a memory buffer.
it_it: :cpp:func:`lv_binfont_create_from_buffer` può essere utilizzato per caricare un font da un buffer di memoria.

source: :cpp:func:`lv_binfont_create` can be used to load a font from a file.
it_it: :cpp:func:`lv_binfont_create` può essere utilizzato per caricare un font da un file.

source: :cpp:func:`lv_chart_set_next_value` can behave in two ways depending on *update mode*:
it_it: :cpp:func:`lv_chart_set_next_value` può comportarsi in due modi a seconda della *modalità di aggiornamento*:

source: :cpp:func:`lv_color_white` and :cpp:func:`lv_color_black` return ``0xFFFFFF`` and ``0x000000`` respectively.
it_it: :cpp:func:`lv_color_white` e :cpp:func:`lv_color_black` restituiscono rispettivamente ``0xFFFFFF`` e ``0x000000``.

source: :cpp:func:`lv_display_flush_ready` (:ref:`flush_callback` for more information)
it_it: :cpp:func:`lv_display_flush_ready` (:ref:`flush_callback` per maggiori informazioni)

source: :cpp:func:`lv_draw_eve_pre_upload_font_range` is used to upload a range of characters.
it_it: :cpp:func:`lv_draw_eve_pre_upload_font_range` viene utilizzato per caricare un intervallo di caratteri.

source: :cpp:func:`lv_draw_eve_pre_upload_font_text` is used to upload all the glyphs that are needed to render a specific string (ASCII or UTF-8).
it_it: :cpp:func:`lv_draw_eve_pre_upload_font_text` viene utilizzato per caricare tutti i glifi necessari per il rendering di una stringa specifica (ASCII o UTF-8).

source: :cpp:func:`lv_draw_eve_pre_upload_image` is used to upload images.
it_it: :cpp:func:`lv_draw_eve_pre_upload_image` viene utilizzato per caricare le immagini.

source: :cpp:func:`lv_imgfont_create` registers ``path_cb`` and receives ``user_data`` as the last argument.
it_it: :cpp:func:`lv_imgfont_create` registra ``path_cb`` e riceve ``user_data`` come ultimo argomento.

source: :cpp:func:`lv_indev_read`, :cpp:func:`lv_timer_handler`, and :cpp:func:`_lv_display_refr_timer` cannot run at the same time.
it_it: :cpp:func:`lv_indev_read`, :cpp:func:`lv_timer_handler` e :cpp:func:`_lv_display_refr_timer` non possono essere eseguiti contemporaneamente.

source: :cpp:func:`lv_init` (note there are no parentheses after the function name) :c:macro:`LV_USE_FLEX` :cpp:type:`lv_event_t` :cpp:enum:`lv_state_t` :cpp:enumerator:`LV_STATE_CHECKED` :cpp:struct:`lv_image_dsc_t` :cpp:union:`lv_style_value_t`
it_it: :cpp:func:`lv_init` (notare che non ci sono parentesi dopo il nome della funzione) :c:macro:`LV_USE_FLEX` :cpp:type:`lv_event_t` :cpp:enum:`lv_state_t` :cpp:enumerator:`LV_STATE_CHECKED` :cpp:struct:`lv_image_dsc_t` :cpp:union:`lv_style_value_t`

source: :cpp:func:`lv_layer_sys`, and
it_it: :cpp:func:`lv_layer_sys` e

source: :cpp:func:`lv_linux_drm_mode_get_horizontal_resolution` - Get width in pixels
it_it: :cpp:func:`lv_linux_drm_mode_get_horizontal_resolution` - Ottiene la larghezza in pixel

source: :cpp:func:`lv_linux_drm_mode_get_refresh_rate` - Get refresh rate in Hz
it_it: :cpp:func:`lv_linux_drm_mode_get_refresh_rate` - Ottiene la frequenza di aggiornamento in Hz

source: :cpp:func:`lv_linux_drm_mode_get_vertical_resolution` - Get height in pixels
it_it: :cpp:func:`lv_linux_drm_mode_get_vertical_resolution` - Ottiene l'altezza in pixel

source: :cpp:func:`lv_linux_drm_mode_is_preferred` - Check if mode is the display's preferred/native mode
it_it: :cpp:func:`lv_linux_drm_mode_is_preferred` - Verifica se la modalità è quella preferita/nativa del display

source: :cpp:func:`lv_obj_delete` deletes the widget immediately.
it_it: :cpp:func:`lv_obj_delete` elimina il widget immediatamente.

source: :cpp:func:`lv_obj_id_compare` compares 2 ``void * id`` values and returns ``0`` when they are considered equal, and non-zero otherwise.
it_it: :cpp:func:`lv_obj_id_compare` confronta 2 valori ``void * id`` e restituisce ``0`` quando sono considerati uguali, altrimenti un valore diverso da zero.

source: :cpp:func:`lv_obj_stringify_id` converts the passed ``widget`` to a string representation (typically incorporating the ``id`` field) and writes it into the buffer provided in its ``buf`` argument.
it_it: :cpp:func:`lv_obj_stringify_id` converte il ``widget`` passato, in una rappresentazione stringa (in genere incorporando il campo ``id``) e lo scrive nel buffer fornito nel suo argomento ``buf``.
